//----------------------------------------------------------------------------

//Модуль управления вентилятором, заголовочный файл

//----------------------------------------------------------------------------

#ifndef FAN_H
#define FAN_H

//------------------------------- Константы: ---------------------------------

#define FAN_MAX_SPEED 100 //максимальная скорость вентилятора, %

//----------------------------------------------------------------------------
//------------------------------ Класс TFan: ---------------------------------
//----------------------------------------------------------------------------

class TFan
{
private:
  TGpio<PORTB, PIN14> Pin_FAN;
  int32_t Pi_Out;
  uint16_t Pi_In;
  uint8_t Speed;
public:
  TFan(void);
  void SetSpeed(uint8_t p);
  uint8_t GetSpeed(void);
  void PiReg(uint16_t ref, uint16_t inp);
};

//----------------------------------------------------------------------------

#endif
