//----------------------------------------------------------------------------

//Главный модуль, заголовочный файл

//----------------------- Используемые ресурсы: ------------------------------

//PA0 - сигнал EF1 энкодера
//PA1 - сигнал EF2 энкодера
//PA2 (USART2 TX) - сигнал OWPO шины OWP термометра
//PA3 (USART2 RD) - сигнал OWPI шины OWP термометра
//PA4 (DAC1 + DMA CH2 + TIM3) - аналоговый выход SET_I
//PA5 (DAC2 + DMA CH3 + TIM3) - аналоговый выход SET_V
//PA6 (ADC6 + DMA CH5 + TIM2) - аналоговый вход GET_I
//PA7 (ADC7 + DMA CH7 + TIM2) - аналоговый вход GET_V
//PB0 - вход режима источника CC/CV
//PB1 - выход включения источника ON
//PB10 - кнопка включения выхода BT_OUT
//PB11 - кнопка точной регулировки BT_FINE
//PB12 - кнопка установки тока BT_SET_I
//PB13 (TIM1 CH1N) - выход звука SND
//PB14 (TIM15 CH1) - выход ШИМ вентилятора FAN
//PB15 - кнопка установки напряжения BT_SET_V
//PA8 - кнопка энкодера SB
//PA9 (USART1 TXD) - выход порта TXD
//PA10 (USART1 RXD) - вход порта RXD
//PB3 (SPI1 SCK) - выход SCLK шины SPI регистра дисплея
//PB5 (SPI1 MOSI) - выход SDATA шины SPI регистра дисплея
//PB6 - выход LOAD регистра дисплея
//PB7 - выход OE регистра дисплея
//PB8 (+ TIM16) - сигнал SCL шины I2C внешней EEPROM 24C04
//PB9 (+ TIM16) - сигнал SDA шины I2C внешней EEPROM 24C04

//Используется опция линкера Linker->Extra options: --basic_heap

//----------------------------------------------------------------------------

#ifndef MAIN_H
#define MAIN_H

//----------------------------------------------------------------------------

#include <stdint.h>
#include "stm32f10x.h"
#include "gpio.h"
#include "timer.h"

//------------------------- Номер версии firmware: ---------------------------

#define VERSION 1.00

//--------------------------- Макроопределения: ------------------------------

#define LO(x)    ((uint8_t)((x) & 0xFF))
#define HI(x)    ((uint8_t)(((x) >> 8) & 0xFF))
#define BYTE1(x) (LO(x))
#define BYTE2(x) (HI(x))
#define BYTE3(x) ((uint8_t)(((uint32_t)(x) >> 16) & 0xFF))
#define BYTE4(x) ((uint8_t)(((uint32_t)(x) >> 24) & 0xFF))

#define WORD(b1,b0)        (((uint16_t)(b1) << 8) | (b0))
#define DWORD(b3,b2,b1,b0) (((uint32_t)WORD(b3,b2) << 16) | WORD(b1,b0))

#define ABS(x) ((x < 0)? -x : x)  

#ifndef NULL
  #define NULL _NULL
#endif

//----------------------------------------------------------------------------

#endif
